08-rails/moma/app/controllers/artists_controller.rb

    def create
        artist = Artist.create artist_params
---
INSERT INTO "artists" ("name", "nationality", "dob", "period", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "adfh"], ["nationality", "dfhie"], ["dob", "1980-03-31"], ["period", "80"], ["image", ""], ["created_at", "2020-10-14 03:26:57.255928"], ["updated_at", "2020-10-14 03:26:57.255928"]]