08-rails/solar_system/app/controllers/planets_controller.rb

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
    # raise : eye sigh
    @planet = Planet.find params[:id]