08-rails/tunr/app/controllers/session_controller.rb

  def create
    # raise "hell"
  # params [:email]
  # find a user
  user =User.find_by :email => params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "craigsy@ga.co"], ["LIMIT", 1]]